package com.blue.eyes.sort.service;

/*** 
 *                    .::::. 
 *                  .::::::::. 
 *                 :::::::::::        @author liuhai
 *             ..:::::::::::'         @date 2019-09-06 13:51
 *           '::::::::::::'           @description 冒泡排序接口
 *             .:::::::::: 
 *        '::::::::::::::.. 
 *             ..::::::::::::. 
 *           ``:::::::::::::::: 
 *            ::::``:::::::::'        .:::. 
 *           ::::'   ':::::'       .::::::::. 
 *         .::::'      ::::     .:::::::'::::. 
 *        .:::'       :::::  .:::::::::' ':::::. 
 *       .::'        :::::.:::::::::'      ':::::. 
 *      .::'         ::::::::::::::'         ``::::. 
 *  ...:::           ::::::::::::'              ``::. 
 * ```` ':.          ':::::::::'                  ::::.. 
 *                    '.:::::'                    ':'````.. 
 */
public interface BubbleSortService {

    /**
     * 冒泡升序排序
     * @param ary
     * @return
     */
    Integer[] sortAsc(Integer[] ary);

    /**
     * 冒泡降序排序
     * @param ary
     * @return
     */
    Integer[] sortDesc(Integer[] ary);
}
